## "Пропуск некорректных данных"

### Задание

Дан файл [data/info.txt](data/info.txt), в каждой строке которого содержится строка или целое число. \
Найдите сумму всех чисел, пропуская все строки, которые нельзя преобразовать к типу int.

### Формат входных данных

Дан текстовый файл, на каждой строке которого целое число или произвольный текст.

### Формат выходных данных

Программа ничего не выводит в терминал, все сообщения записываются в указанный файл или в файл по умолчанию.

### Решение задачи

```python
import os.path

summa = 0
path = os.path.join('data', 'info.txt')
path_out = os.path.join('data', 'info_out.txt')
with open(path, 'r', encoding='UTF-8') as f:
    for line in f:
        if line.strip().isnumeric() or (line[0] == '-' and line[1:].strip().isdigit()):
            summa += int(line)
print(f"Сумма всех чисел = {summa}")
with open(path_out, 'w', encoding='UTF-8') as f:
    f.write(f"Сумма всех чисел = {summa}")
# Уточнение: в сумму добавляем только те значения, которые можно преобразовать к int'у
# Например: int("-26") --> -26, а int("--26") --> ошибка
```

---
